vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1041_DFP.pdsc
    <condition id='allOf.utility.assert, utility.debug_console, device=MIMXRT1041.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='device.MIMXRT1042.internal_condition'>
      <accept Dname='MIMXRT1042DFP6B' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1042DJM6B' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1042XFP5B' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1042XJM5B' Dvendor='NXP:11'/>
    </condition>
    <condition id='component.flash_adapter.condition_id'>
      <require condition='allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, allOf=board=evkmimxrt1040, component.flexspi_nor_flash_adapter_rt1040evk, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, allOf=board=evkmimxrt1040, component.flexspi_nor_flash_adapter_rt1040evk, device=MIMXRT1041.internal_condition'>
      <require condition='anyOf.allOf=component.mcxw_flash_adapter, driver.romapi, allOf=board=evkmimxrt1040, component.flexspi_nor_flash_adapter_rt1040evk.internal_condition'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.mcxw_flash_adapter, driver.romapi, allOf=board=evkmimxrt1040, component.flexspi_nor_flash_adapter_rt1040evk.internal_condition'>
      <accept condition='allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition'/>
      <accept condition='allOf.board=evkmimxrt1040, component.flexspi_nor_flash_adapter_rt1040evk.internal_condition'/>
    </condition>
    <condition id='allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='mcxw_flash_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='romapi'/>
    </condition>
    <condition id='allOf.board=evkmimxrt1040, component.flexspi_nor_flash_adapter_rt1040evk.internal_condition'>
      <require condition='board.evkmimxrt1040.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='adapter_rt1040evk'/>
    </condition>
    <condition id='board.evkmimxrt1040.internal_condition'>
      <accept condition='device.MIMXRT1041.internal_condition'/>
      <accept condition='device.MIMXRT1042.internal_condition'/>
    </condition>
    <condition id='component.flash_nand_flexspi.condition_id'>
      <require condition='allOf.driver.flexspi, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.driver.flexspi, device=MIMXRT1041.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexspi'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.flash_nand_semc.condition_id'>
      <require condition='allOf.driver.semc, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.driver.semc, device=MIMXRT1041.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='semc'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.flash_nor_flexspi.condition_id'>
      <require condition='allOf.driver.flexspi, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.flash_nor_lpspi.condition_id'>
      <require condition='allOf.driver.lpspi, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpspi, device=MIMXRT1041.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.flexspi_nor_flash_adapter_rt1040evk.condition_id'>
      <require condition='allOf.board=evkmimxrt1040, driver.flexspi, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.board=evkmimxrt1040, driver.flexspi, device=MIMXRT1041.internal_condition'>
      <require condition='board.evkmimxrt1040.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexspi'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.gpt_adapter.condition_id'>
      <require condition='allOf.driver.gpt, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.driver.gpt, device=MIMXRT1041.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpt'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.i2c_adapter_interface.condition_id'>
      <require condition='allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, device=MIMXRT1041.internal_condition'>
      <require condition='anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'>
      <accept condition='allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'>
      <require condition='anyOf.driver.lpi2c.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpi2c_adapter'/>
    </condition>
    <condition id='anyOf.driver.lpi2c.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
    </condition>
    <condition id='component.i2c_mux.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.i2c_mux_pca954x.condition_id'>
      <require condition='allOf.component.i2c_mux, device=MIMXRT1041.internal_condition'/>
    </condition>
