vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1041_DFP.pdsc
    <condition id='allOf.anyOf=device_id=MIMXRT1041xxxxB, component.silicon_id_imxrt10xx.internal_condition'>
      <require condition='anyOf.device_id=MIMXRT1041xxxxB.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='silicon_id_rt10xx'/>
    </condition>
    <condition id='anyOf.device_id=MIMXRT1041xxxxB.internal_condition'>
      <accept condition='device_id.MIMXRT1041xxxxB.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imx8.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imx93.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imxrt10xx.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imxrt1170.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imxrt1180.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_mcxn.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_rw610.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_scfw.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.software_crc_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.software_rng_adapter.condition_id'>
      <require condition='allOf.component.rng_adapter_interface, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.component.rng_adapter_interface, device=MIMXRT1041.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='rng_adapter_interface'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.tfa9896_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.tfa9xxx_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.timer_manager.condition_id'>
      <require condition='allOf.anyOf=allOf=component.gpt_adapter, driver.gpt, allOf=component.pit_adapter, driver.pit, component.lists, driver.common, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.gpt_adapter, driver.gpt, allOf=component.pit_adapter, driver.pit, component.lists, driver.common, device=MIMXRT1041.internal_condition'>
      <require condition='anyOf.allOf=component.gpt_adapter, driver.gpt, allOf=component.pit_adapter, driver.pit.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.gpt_adapter, driver.gpt, allOf=component.pit_adapter, driver.pit.internal_condition'>
      <accept condition='allOf.component.gpt_adapter, driver.gpt.internal_condition'/>
      <accept condition='allOf.component.pit_adapter, driver.pit.internal_condition'/>
    </condition>
    <condition id='allOf.component.gpt_adapter, driver.gpt.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpt_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpt'/>
    </condition>
    <condition id='allOf.component.pit_adapter, driver.pit.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pit_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pit'/>
    </condition>
    <condition id='component.trng_adapter.condition_id'>
      <require condition='allOf.component.rng_adapter_interface, driver.trng, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.component.rng_adapter_interface, driver.trng, device=MIMXRT1041.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='rng_adapter_interface'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='trng'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.wm8524_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.wm8904_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.wm8960_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='component.wm8962_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='device.CMSIS.condition_id'>
      <require condition='allOf.CMSIS_Include_core_cm, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Include_core_cm, device=MIMXRT1041.internal_condition'>
      <require Cclass='CMSIS' Cgroup='CORE'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='device.RTE.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='device.boot_header.condition_id'>
      <require condition='allOf.device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='device.linker.condition_id'>
      <require condition='allOf.device_id=MIMXRT1041xxxxB.internal_condition'/>
    </condition>
    <condition id='allOf.device_id=MIMXRT1041xxxxB.internal_condition'>
      <require condition='device_id.MIMXRT1041xxxxB.internal_condition'/>
    </condition>
    <condition id='device_ids.MIMXRT1041xxxxB.internal_condition'>
      <accept Dname='MIMXRT1041DFP6B' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1041DJM6B' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1041XFP5B' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1041XJM5B' Dvendor='NXP:11'/>
    </condition>
    <condition id='allOf.toolchains=mdk, device_ids=MIMXRT1041xxxxB.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
      <require condition='device_ids.MIMXRT1041xxxxB.internal_condition'/>
    </condition>
