vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1041_DFP.pdsc
    <condition id='toolchains.mdk.internal_condition'>
      <accept Tcompiler='ARMCC'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, device_ids=MIMXRT1041xxxxB.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
      <require condition='device_ids.MIMXRT1041xxxxB.internal_condition'/>
    </condition>
    <condition id='toolchains.armgcc.internal_condition'>
      <accept Tcompiler='GCC'/>
    </condition>
    <condition id='allOf.toolchains=iar, device_ids=MIMXRT1041xxxxB.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
      <require condition='device_ids.MIMXRT1041xxxxB.internal_condition'/>
    </condition>
    <condition id='toolchains.iar.internal_condition'>
      <accept Tcompiler='IAR'/>
    </condition>
    <condition id='device.project_template.condition_id'>
      <require condition='allOf.device_id=MIMXRT1041xxxxB, CMSIS_Include_core_cm, device.startup, driver.clock, driver.common, driver.igpio, driver.iomuxc, driver.dcdc_1, driver.gpc_1, driver.src, driver.pmu, device.boot_header, component.lpuart_adapter, utility.debug_console_lite, utility.assert_lite, utility.str.internal_condition'/>
    </condition>
    <condition id='allOf.device_id=MIMXRT1041xxxxB, CMSIS_Include_core_cm, device.startup, driver.clock, driver.common, driver.igpio, driver.iomuxc, driver.dcdc_1, driver.gpc_1, driver.src, driver.pmu, device.boot_header, component.lpuart_adapter, utility.debug_console_lite, utility.assert_lite, utility.str.internal_condition'>
      <require condition='device_id.MIMXRT1041xxxxB.internal_condition'/>
      <require Cclass='CMSIS' Cgroup='CORE'/>
      <require Cclass='Device' Cgroup='Startup' Csub=''/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='clock'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='iomuxc'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dcdc_1'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpc'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='src'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pmu'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='xip_device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_adapter'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert_lite'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
    </condition>
    <condition id='device.startup.condition_id'>
      <require condition='allOf.device.system, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.device.system, device=MIMXRT1041.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MIMXRT1041_system'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=iar.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=mdk.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
    </condition>
    <condition id='device.system.condition_id'>
      <require condition='allOf.device.CMSIS, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.device.CMSIS, device=MIMXRT1041.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MIMXRT1041_header'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='driver.adc_12b1msps_sar.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1041xxxxB.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, device_id=MIMXRT1041xxxxB.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device_id.MIMXRT1041xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.adc_etc.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1041xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.aipstz.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1041xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.ak4497.condition_id'>
      <require condition='allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MIMXRT1041.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='ak4497_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_adapters'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_i2c'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='driver.aoi.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1041xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.bee.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1041xxxxB.internal_condition'/>
    </condition>
    <condition id='driver.cache_armv7_m7.condition_id'>
      <require condition='allOf.driver.common, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='driver.camera-common.condition_id'>
      <require condition='allOf.driver.video-common, device=MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='allOf.driver.video-common, device=MIMXRT1041.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='video-common'/>
      <require condition='device.MIMXRT1041.internal_condition'/>
    </condition>
    <condition id='driver.camera-device-ap1302.condition_id'>
      <require condition='allOf.driver.camera-device-common, driver.video-i2c, device=MIMXRT1041.internal_condition'/>
    </condition>
