vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1041_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='silicon_id_mcxn' Cversion='2.0.0' condition='component.silicon_id_mcxn.condition_id'>
      <description>Driver silicon_id mcxn</description>
      <files>
        <file category='sourceC' name='components/silicon_id/socs/mcxn/fsl_silicon_id_soc.c' projectpath='component/silicon_id'/>
        <file category='header' name='components/silicon_id/socs/fsl_silicon_id_soc.h' projectpath='component'/>
        <file category='include' name='components/silicon_id/socs/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='silicon_id_rw610' Cversion='2.0.0' condition='component.silicon_id_rw610.condition_id'>
      <description>Driver silicon_id rw610</description>
      <files>
        <file category='sourceC' name='components/silicon_id/socs/rw610/fsl_silicon_id_soc.c' projectpath='component/silicon_id'/>
        <file category='header' name='components/silicon_id/socs/fsl_silicon_id_soc.h' projectpath='component'/>
        <file category='include' name='components/silicon_id/socs/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='silicon_id_scfw' Cversion='2.0.0' condition='component.silicon_id_scfw.condition_id'>
      <description>Driver silicon_id scfw</description>
      <files>
        <file category='sourceC' name='components/silicon_id/socs/scfw/fsl_silicon_id_soc.c' projectpath='component/silicon_id'/>
        <file category='header' name='components/silicon_id/socs/fsl_silicon_id_soc.h' projectpath='component'/>
        <file category='include' name='components/silicon_id/socs/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='software_crc_adapter' Cversion='1.0.0' condition='component.software_crc_adapter.condition_id'>
      <description>Component software_crc_adapter</description>
      <files>
        <file category='header' name='components/crc/fsl_adapter_crc.h' projectpath='component/crc'/>
        <file category='sourceC' name='components/crc/fsl_adapter_software_crc.c' projectpath='component/crc'/>
        <file category='include' name='components/crc/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='software_rng_adapter' Cversion='1.0.0' condition='component.software_rng_adapter.condition_id'>
      <description>Component software_rng_adapter</description>
      <files>
        <file category='sourceC' name='components/rng/fsl_adapter_software_rng.c' projectpath='component/rng'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tfa9896_adapter' Cversion='2.2.0' condition='component.tfa9896_adapter.condition_id'>
      <description>Component tfa9896 adapter for single codec</description>
      <files>
        <file category='header' name='components/codec/port/tfa9896/fsl_codec_tfa9896_adapter.h' projectpath='codec/port/tfa9896'/>
        <file category='sourceC' name='components/codec/port/tfa9896/fsl_codec_tfa9896_adapter.c' projectpath='codec/port/tfa9896'/>
        <file category='header' name='components/codec/port/fsl_codec_adapter.h' projectpath='codec/port'/>
        <file category='include' name='components/codec/port/tfa9896/'/>
        <file category='include' name='components/codec/port/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tfa9xxx_adapter' Cversion='2.2.0' condition='component.tfa9xxx_adapter.condition_id'>
      <description>Component tfa9xxx adapter for single codec</description>
      <files>
        <file category='header' name='components/codec/port/tfa9xxx/fsl_codec_tfa9xxx_adapter.h' projectpath='codec/port/tfa9xxx'/>
        <file category='sourceC' name='components/codec/port/tfa9xxx/fsl_codec_tfa9xxx_adapter.c' projectpath='codec/port/tfa9xxx'/>
        <file category='header' name='components/codec/port/fsl_codec_adapter.h' projectpath='codec/port'/>
        <file category='include' name='components/codec/port/tfa9xxx/'/>
        <file category='include' name='components/codec/port/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='timer_manager' Cversion='1.0.0' condition='component.timer_manager.condition_id'>
      <description>Component timer_manager</description>
      <files>
        <file category='header' name='components/timer_manager/fsl_component_timer_manager.h' projectpath='component/timer_manager'/>
        <file category='sourceC' name='components/timer_manager/fsl_component_timer_manager.c' projectpath='component/timer_manager'/>
        <file category='include' name='components/timer_manager/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='trng_adapter' Cversion='1.0.0' condition='component.trng_adapter.condition_id'>
      <description>Component trng_adapter</description>
      <files>
        <file category='sourceC' name='components/rng/fsl_adapter_trng.c' projectpath='component/rng'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wm8524_adapter' Cversion='2.2.0' condition='component.wm8524_adapter.condition_id'>
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category='header' name='components/codec/port/wm8524/fsl_codec_wm8524_adapter.h' projectpath='codec/port/wm8524'/>
        <file category='sourceC' name='components/codec/port/wm8524/fsl_codec_wm8524_adapter.c' projectpath='codec/port/wm8524'/>
        <file category='header' name='components/codec/port/fsl_codec_adapter.h' projectpath='codec/port'/>
        <file category='include' name='components/codec/port/wm8524/'/>
        <file category='include' name='components/codec/port/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wm8904_adapter' Cversion='2.2.0' condition='component.wm8904_adapter.condition_id'>
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category='header' name='components/codec/port/wm8904/fsl_codec_wm8904_adapter.h' projectpath='codec/port/wm8904'/>
        <file category='sourceC' name='components/codec/port/wm8904/fsl_codec_wm8904_adapter.c' projectpath='codec/port/wm8904'/>
        <file category='header' name='components/codec/port/fsl_codec_adapter.h' projectpath='codec/port'/>
        <file category='include' name='components/codec/port/wm8904/'/>
        <file category='include' name='components/codec/port/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wm8960_adapter' Cversion='2.2.0' condition='component.wm8960_adapter.condition_id'>
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category='header' name='components/codec/port/wm8960/fsl_codec_wm8960_adapter.h' projectpath='codec/port/wm8960'/>
        <file category='sourceC' name='components/codec/port/wm8960/fsl_codec_wm8960_adapter.c' projectpath='codec/port/wm8960'/>
        <file category='header' name='components/codec/port/fsl_codec_adapter.h' projectpath='codec/port'/>
        <file category='include' name='components/codec/port/wm8960/'/>
        <file category='include' name='components/codec/port/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wm8962_adapter' Cversion='2.2.0' condition='component.wm8962_adapter.condition_id'>
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category='header' name='components/codec/port/wm8962/fsl_codec_wm8962_adapter.h' projectpath='codec/port/wm8962'/>
        <file category='sourceC' name='components/codec/port/wm8962/fsl_codec_wm8962_adapter.c' projectpath='codec/port/wm8962'/>
        <file category='header' name='components/codec/port/fsl_codec_adapter.h' projectpath='codec/port'/>
        <file category='include' name='components/codec/port/wm8962/'/>
        <file category='include' name='components/codec/port/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='CMSIS' Csub='MIMXRT1041_header' Cversion='1.0.0' condition='device.CMSIS.condition_id'>
      <description>Device MIMXRT1041_cmsis</description>
      <files>
        <file category='header' name='devices/MIMXRT1041/fsl_device_registers.h' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1041/MIMXRT1041.h' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1041/MIMXRT1041_features.h' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1041/MIMXRT1041_COMMON.h' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_ADC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_ADC_ETC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_AIPSTZ.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_AOI.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_BEE.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_CAN.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_CCM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_CCM_ANALOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_CM7_MCM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_CMP.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_CSU.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_DCDC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_DCP.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_DMA.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_DMAMUX.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_ENC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_ENET.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_EWM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_FLEXIO.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_FLEXRAM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_FLEXSPI.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_GPC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_GPIO.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_GPT.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_I2S.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_IOMUXC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_IOMUXC_GPR.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_IOMUXC_SNVS.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_IOMUXC_SNVS_GPR.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_LCDIF.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_LPI2C.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_LPSPI.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_LPUART.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_OCOTP.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_PGC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_PIT.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_PMU.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_PWM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_PXP.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_RTWDOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_SEMC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_SNVS.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_SPDIF.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_SRC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_TEMPMON.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_TMR.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_TRNG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_USB.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_USBNC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_USBPHY.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_USB_ANALOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_USDHC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_WDOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_XBARA.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_XBARB.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1041/periph/PERI_XTALOSC24M.h' projectpath='device/periph'/>
        <file category='include' name='devices/MIMXRT1041/'/>
        <file category='include' name='devices/MIMXRT1041/periph/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device' Cversion='1.0.0' condition='device.RTE.condition_id'>
      <description>Rte_device</description>
      <files>
        <file category='header' attr='config' name='devices/MIMXRT1041/template/RTE_Device.h' version='1.0.0' projectpath='board'/>
        <file category='include' name='devices/MIMXRT1041/template/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='xip_device' Cversion='1.0.0' condition='device.boot_header.condition_id'>
      <description>Device Boot Header</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/xip/fsl_flexspi_nor_boot.c' projectpath='xip'/>
        <file category='header' name='devices/MIMXRT1041/xip/fsl_flexspi_nor_boot.h' projectpath='xip'/>
        <file category='include' name='devices/MIMXRT1041/xip/'/>
      </files>
    </component>
