vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1041_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ektf2k' Cversion='1.0.0' condition='driver.ektf2k.condition_id'>
      <description>Driver ektf2k</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category='header' name='components/touch/ektf2k/fsl_ektf2k.h' projectpath='touchpanel'/>
        <file category='sourceC' name='components/touch/ektf2k/fsl_ektf2k.c' projectpath='touchpanel'/>
        <file category='include' name='components/touch/ektf2k/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='enc' Cversion='2.2.1' condition='driver.enc.condition_id'>
      <description>ENC Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_enc.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_enc.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='enet' Cversion='2.9.2' condition='driver.enet.condition_id'>
      <description>ENET Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_enet.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_enet.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ewm' Cversion='2.0.4' condition='driver.ewm.condition_id'>
      <description>EWM Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_ewm.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_ewm.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexcan' Cversion='2.14.1' condition='driver.flexcan.condition_id'>
      <description>FLEXCAN Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexcan.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexcan.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexcan_edma' Cversion='2.12.0' condition='driver.flexcan_edma.condition_id'>
      <description>FLEXCAN Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexcan_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexcan_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio' Cversion='2.3.0' condition='driver.flexio.condition_id'>
      <description>FLEXIO Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexio.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexio.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_i2c_master' Cversion='2.6.1' condition='driver.flexio_i2c_master.condition_id'>
      <description>FLEXIO I2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexio_i2c_master.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexio_i2c_master.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_i2s' Cversion='2.2.1' condition='driver.flexio_i2s.condition_id'>
      <description>FLEXIO I2S Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexio_i2s.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexio_i2s.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_i2s_edma' Cversion='2.1.8' condition='driver.flexio_i2s_edma.condition_id'>
      <description>FLEXIO I2S EDMA Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexio_i2s_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexio_i2s_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_spi' Cversion='2.4.2' condition='driver.flexio_spi.condition_id'>
      <description>FLEXIO SPI Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexio_spi.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexio_spi.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_spi_edma' Cversion='2.3.0' condition='driver.flexio_spi_edma.condition_id'>
      <description>FLEXIO SPI EDMA Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexio_spi_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexio_spi_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_uart' Cversion='2.6.2' condition='driver.flexio_uart.condition_id'>
      <description>FLEXIO UART Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexio_uart.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexio_uart.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_uart_edma' Cversion='2.4.1' condition='driver.flexio_uart_edma.condition_id'>
      <description>FLEXIO UART EDMA Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexio_uart_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexio_uart_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexram' Cversion='2.3.0' condition='driver.flexram.condition_id'>
      <description>FLEXRAM Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexram.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexram.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='soc_flexram_allocate' Cversion='2.0.2' condition='driver.flexram_allocate.condition_id'>
      <description>SOC FLEXRAM ALLOCATE Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexram_allocate.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexram_allocate.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexspi' Cversion='2.7.0' condition='driver.flexspi.condition_id'>
      <description>FLEXSPI Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexspi.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexspi.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flexspi_edma' Cversion='2.3.3' condition='driver.flexspi_edma.condition_id'>
      <description>FLEXSPI Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_flexspi_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_flexspi_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ft3267' Cversion='1.0.1' condition='driver.ft3267.condition_id'>
      <description>Touch panel controller FT3267 driver</description>
      <files>
        <file category='header' name='components/touch/ft3267/fsl_ft3267.h' projectpath='touchpanel'/>
        <file category='sourceC' name='components/touch/ft3267/fsl_ft3267.c' projectpath='touchpanel'/>
        <file category='include' name='components/touch/ft3267/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ft5406' Cversion='1.0.0' condition='driver.ft5406.condition_id'>
      <description>Driver ft5406</description>
      <files>
        <file category='header' name='components/touch/ft5406/fsl_ft5406.h' projectpath='touchpanel'/>
        <file category='sourceC' name='components/touch/ft5406/fsl_ft5406.c' projectpath='touchpanel'/>
        <file category='include' name='components/touch/ft5406/'/>
      </files>
    </component>
