vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1041_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='sai' Cversion='2.4.7' condition='driver.sai.condition_id'>
      <description>SAI Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_sai.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_sai.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='sai_edma' Cversion='2.7.3' condition='driver.sai_edma.condition_id'>
      <description>SAI EDMA Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_sai_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_sai_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='semc' Cversion='2.7.1' condition='driver.semc.condition_id'>
      <description>SEMC Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_semc.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_semc.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='sgtl5000' Cversion='2.1.1' condition='driver.sgtl5000.condition_id'>
      <description>Driver sgtl5000</description>
      <RTE_Components_h>
#ifndef CODEC_SGTL5000_ENABLE
#define CODEC_SGTL5000_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/codec/sgtl5000/fsl_sgtl5000.h' projectpath='codec'/>
        <file category='sourceC' name='components/codec/sgtl5000/fsl_sgtl5000.c' projectpath='codec'/>
        <file category='include' name='components/codec/sgtl5000/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='snvs_hp' Cversion='2.3.2' condition='driver.snvs_hp.condition_id'>
      <description>SNVS HP Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_snvs_hp.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_snvs_hp.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='snvs_lp' Cversion='2.4.6' condition='driver.snvs_lp.condition_id'>
      <description>SNVS LP Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_snvs_lp.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_snvs_lp.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='spdif' Cversion='2.0.7' condition='driver.spdif.condition_id'>
      <description>SPDIF Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_spdif.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_spdif.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='spdif_edma' Cversion='2.0.8' condition='driver.spdif_edma.condition_id'>
      <description>SPDIF EDMA Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_spdif_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_spdif_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='src' Cversion='2.0.1' condition='driver.src.condition_id'>
      <description>SRC Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_src.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_src.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ssd1963' Cversion='1.2.0' condition='driver.ssd1963.condition_id'>
      <description>Driver ssd1963</description>
      <files>
        <file category='header' name='components/display/ssd1963/fsl_ssd1963.h' projectpath='lcdc'/>
        <file category='sourceC' name='components/display/ssd1963/fsl_ssd1963.c' projectpath='lcdc'/>
        <file category='include' name='components/display/ssd1963/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='st7796s' Cversion='1.0.0' condition='driver.st7796s.condition_id'>
      <description>Driver st7796s</description>
      <files>
        <file category='header' name='components/display/st7796s/fsl_st7796s.h' projectpath='lcdc'/>
        <file category='sourceC' name='components/display/st7796s/fsl_st7796s.c' projectpath='lcdc'/>
        <file category='include' name='components/display/st7796s/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tempmon' Cversion='2.2.1' condition='driver.tempmon.condition_id'>
      <description>TEMPMON Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_tempmon.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_tempmon.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tfa9896' Cversion='6.0.2' condition='driver.tfa9896.condition_id'>
      <description>Driver tfa9896</description>
      <RTE_Components_h>
#ifndef CODEC_TFA9896_ENABLE
#define CODEC_TFA9896_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/codec/tfa9896/fsl_tfa9896_buffer.h' projectpath='codec'/>
        <file category='sourceC' name='components/codec/tfa9896/fsl_hal_registers.c' projectpath='codec'/>
        <file category='sourceC' name='components/codec/tfa9896/fsl_tfa9896.c' projectpath='codec'/>
        <file category='header' name='components/codec/tfa9896/fsl_tfa9896.h' projectpath='codec'/>
        <file category='doc' name='components/codec/tfa9896/MIMXRT595595-EVK_TFA9896_SW.pdf' projectpath='codec'/>
        <file category='include' name='components/codec/tfa9896/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tfa9xxx' Cversion='2.1.0' condition='driver.tfa9xxx.condition_id'>
      <description>Driver tfa9xxx</description>
      <RTE_Components_h>
#ifndef CODEC_TFA9XXX_ENABLE
#define CODEC_TFA9XXX_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/codec/tfa9xxx/tfa_config_TFA9892N1.h' projectpath='codec/tfa9xxx'/>
        <file category='header' name='components/codec/tfa9xxx/tfa_config_TFA9894N1.h' projectpath='codec/tfa9xxx'/>
        <file category='header' name='components/codec/tfa9xxx/tfa_config_TFA9894N2.h' projectpath='codec/tfa9xxx'/>
        <file category='sourceC' name='components/codec/tfa9xxx/fsl_tfa9xxx.c' projectpath='codec/tfa9xxx'/>
        <file category='header' name='components/codec/tfa9xxx/fsl_tfa9xxx.h' projectpath='codec/tfa9xxx'/>
        <file category='sourceC' name='components/codec/tfa9xxx/fsl_tfa9xxx_IMX.c' projectpath='codec/tfa9xxx'/>
        <file category='doc' name='components/codec/tfa9xxx/README.md' projectpath='codec/tfa9xxx'/>
        <file category='header' name='components/codec/tfa9xxx/vas_tfa_drv/config.h' projectpath='codec/tfa9xxx/vas_tfa_drv'/>
        <file category='sourceC' name='components/codec/tfa9xxx/vas_tfa_drv/tfa2_container.c' projectpath='codec/tfa9xxx/vas_tfa_drv'/>
        <file category='header' name='components/codec/tfa9xxx/vas_tfa_drv/tfa2_container.h' projectpath='codec/tfa9xxx/vas_tfa_drv'/>
        <file category='sourceC' name='components/codec/tfa9xxx/vas_tfa_drv/tfa2_dev.c' projectpath='codec/tfa9xxx/vas_tfa_drv'/>
        <file category='header' name='components/codec/tfa9xxx/vas_tfa_drv/tfa2_dev.h' projectpath='codec/tfa9xxx/vas_tfa_drv'/>
        <file category='header' name='components/codec/tfa9xxx/vas_tfa_drv/tfa2_dsp_fw.h' projectpath='codec/tfa9xxx/vas_tfa_drv'/>
        <file category='sourceC' name='components/codec/tfa9xxx/vas_tfa_drv/tfa2_haptic.c' projectpath='codec/tfa9xxx/vas_tfa_drv'/>
        <file category='header' name='components/codec/tfa9xxx/vas_tfa_drv/tfa2_haptic.h' projectpath='codec/tfa9xxx/vas_tfa_drv'/>
        <file category='sourceC' name='components/codec/tfa9xxx/vas_tfa_drv/tfa2_init.c' projectpath='codec/tfa9xxx/vas_tfa_drv'/>
        <file category='header' name='components/codec/tfa9xxx/vas_tfa_drv/tfa9xxx_parameters.h' projectpath='codec/tfa9xxx/vas_tfa_drv'/>
        <file category='sourceC' name='components/codec/tfa9xxx/vas_tfa_drv/tfa_container_crc32.c' projectpath='codec/tfa9xxx/vas_tfa_drv'/>
        <file category='header' name='components/codec/tfa9xxx/vas_tfa_drv/tfa_haptic_fw_defs.h' projectpath='codec/tfa9xxx/vas_tfa_drv'/>
        <file category='include' name='components/codec/tfa9xxx/'/>
        <file category='include' name='components/codec/tfa9xxx/vas_tfa_drv/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tfa9xxx_hal' Cversion='2.1.0' condition='driver.tfa9xxx_hal.condition_id'>
      <description>Driver tfa9xxx_hal</description>
      <files>
        <file category='header' name='components/codec/tfa9xxx/tfa_device_hal.h' projectpath='codec/tfa9xxx'/>
        <file category='sourceC' name='components/codec/tfa9xxx/tfa_device_hal.c' projectpath='codec/tfa9xxx'/>
        <file category='include' name='components/codec/tfa9xxx/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tma525b' Cversion='1.0.0' condition='driver.tma525b.condition_id'>
      <description>Driver tma525b</description>
      <files>
        <file category='header' name='components/touch/tma525b/fsl_tma525b.h' projectpath='touchpanel'/>
        <file category='sourceC' name='components/touch/tma525b/fsl_tma525b.c' projectpath='touchpanel'/>
        <file category='include' name='components/touch/tma525b/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='trng' Cversion='2.0.18' condition='driver.trng.condition_id'>
      <description>TRNG Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_trng.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_trng.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tsl2561' Cversion='1.0.0' condition='driver.tsl2561.condition_id'>
      <description>Driver tsl2561</description>
      <files>
        <file category='header' name='components/sensor/tsl2561/fsl_tsl2561.h' projectpath='tsl'/>
        <file category='sourceC' name='components/sensor/tsl2561/fsl_tsl2561.c' projectpath='tsl'/>
        <file category='include' name='components/sensor/tsl2561/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='sdhc' Cversion='2.8.5' condition='driver.usdhc.condition_id'>
      <description>USDHC Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_usdhc.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_usdhc.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='video-common' Cversion='1.1.0' condition='driver.video-common.condition_id'>
      <description>Driver video-common</description>
      <files>
        <file category='header' name='components/video/fsl_video_common.h' projectpath='video'/>
        <file category='sourceC' name='components/video/fsl_video_common.c' projectpath='video'/>
        <file category='include' name='components/video/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='video-i2c' Cversion='1.0.1' condition='driver.video-i2c.condition_id'>
      <description>Driver video-i2c</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category='header' name='components/video/i2c/fsl_video_i2c.h' projectpath='video'/>
        <file category='sourceC' name='components/video/i2c/fsl_video_i2c.c' projectpath='video'/>
        <file category='include' name='components/video/i2c/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wdog' Cversion='2.2.0' condition='driver.wdog01.condition_id'>
      <description>wdog01 Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1041/drivers/fsl_wdog.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1041/drivers/fsl_wdog.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1041/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wm8524' Cversion='2.1.1' condition='driver.wm8524.condition_id'>
      <description>Driver wm8524</description>
      <RTE_Components_h>
#ifndef CODEC_WM8524_ENABLE
#define CODEC_WM8524_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/codec/wm8524/fsl_wm8524.h' projectpath='codec'/>
        <file category='sourceC' name='components/codec/wm8524/fsl_wm8524.c' projectpath='codec'/>
        <file category='include' name='components/codec/wm8524/'/>
      </files>
    </component>
